package ex01;



//클래스의 구성요소
//1. 멤버변수(필드) 클래스 안에 선언된 변수이르모 멤버변수라고 부른다. 인스턴스라고 부른다.
//2. 멤버함수(메소드) 클래스안에 선언된 함수이므로 멤버함수라고 하고, 메소드라고 부른다.

public class Student {
	// 학생클래스를 만들라고?
	// 학생클래스를 구성하는 멤버변수와 멤버함수를 정의하라고
	// 학생클래스에 적합한 멤버변수는 뭘까?
	// 쌤이 번호, 이름, 국어점수, 영어점수, 수학점수를 멤버변수로 하라고 했다.
	// 그렇다는건 학생이란.... 위의것들로 구성되어 있다고 봐야하겠지.
	// 학생에 대한 정의를 그렇게 한거다
	// 번호에 해당하는 멤버변수는 타입은 뭘로 하는게 좋을까? 변수이름은?

	int no;
	String name;
	int kor;
	
	void showStudentInfo() {
		System.out.println(no+" "+name+" "+kor);
		
	}

}
